vendor/webex/xml/NBR_Storage.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions
targetNamespace="http://nta1wss.webex.com/nbr/services/NBRStorageService"
xmlns:tns1="NBRStorageService"
xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:apachesoap="http://xml.apache.org/xml-soap"
xmlns:impl="http://nta1wss.webex.com/nbr/services/NBRStorageService"
xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/"
xmlns:intf="http://nta1wss.webex.com/nbr/services/NBRStorageService">
<!--WSDL created by Apache Axis version: 1.4
Built on Apr 22, 2006 (06:55:48 PDT)-->
    <wsdl:types>
        <schema xmlns="http://www.w3.org/2001/XMLSchema"
        targetNamespace="http://nta1wss.webex.com/nbr/services/NBRStorageService">
            <import namespace="NBRStorageService"/>
            <import namespace="http://schemas.xmlsoap.org/soap/encoding/"/>
            <complexType name="ArrayOf_tns1_DataHandler">
                <complexContent>
                    <restriction base="soapenc:Array">
                        <attribute ref="soapenc:arrayType"
                        wsdl:arrayType="tns1:DataHandler[]"/>
                    </restriction>
                </complexContent>
            </complexType>
        </schema>
    </wsdl:types>
    <wsdl:message name="getNBRStorageFileResponse1">
        <wsdl:part name="getNBRStorageFileReturn" type="tns1:Document"/>
    </wsdl:message>
    <wsdl:message name="downloadWAVFlieRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="downloadNBRStorageFileRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="recordId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="downloadWAVFlieResponse">
        <wsdl:part name="downloadWAVFlieReturn"
        type="impl:ArrayOf_tns1_DataHandler"/>
    </wsdl:message>
    <wsdl:message name="downloadNBRStorageFileResponse">
        <wsdl:part name="downloadNBRStorageFileReturn"
        type="impl:ArrayOf_tns1_DataHandler"/>
    </wsdl:message>
    <wsdl:message name="getNBRStorageFileRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
    </wsdl:message>
        <wsdl:message name="getStorageAccessTicketRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="username" type="xsd:string"/>
        <wsdl:part name="password" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="deleteNBRStorageFileResponse">
        <wsdl:part name="deleteNBRStorageFileReturn" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getNBRStorageFileRequest1">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
        <wsdl:part name="fileType" type="xsd:string"/>
        <wsdl:part name="fromDate" type="xsd:dateTime"/>
        <wsdl:part name="toDate" type="xsd:dateTime"/>
    </wsdl:message>
    <wsdl:message name="getNBRStorageFileResponse">
        <wsdl:part name="getNBRStorageFileReturn" type="tns1:Document"/>
    </wsdl:message>
    <wsdl:message name="deleteNBRStorageFileRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="recordId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getStorageAccessTicketResponse">
        <wsdl:part name="getStorageAccessTicketReturn"
        type="xsd:string"/>
    </wsdl:message>
        <wsdl:portType name="NBRStorageService">
            <wsdl:operation name="getStorageAccessTicket"
            parameterOrder="siteId username password">
                <wsdl:input name="getStorageAccessTicketRequest"
                message="impl:getStorageAccessTicketRequest"/>
                <wsdl:output name="getStorageAccessTicketResponse"
                message="impl:getStorageAccessTicketResponse"/>
            </wsdl:operation>
            <wsdl:operation name="getNBRStorageFile" parameterOrder="siteId confId ticket">
                <wsdl:input name="getNBRStorageFileRequest"
                message="impl:getNBRStorageFileRequest"/>
                <wsdl:output name="getNBRStorageFileResponse"
                message="impl:getNBRStorageFileResponse"/>
            </wsdl:operation>
            <wsdl:operation name="getNBRStorageFile" parameterOrder="siteId confId ticket fileType fromDate toDate">
                <wsdl:input name="getNBRStorageFileRequest1"
                message="impl:getNBRStorageFileRequest1"/>
                <wsdl:output name="getNBRStorageFileResponse1"
                message="impl:getNBRStorageFileResponse1"/>
            </wsdl:operation>
            <wsdl:operation name="downloadNBRStorageFile"
                parameterOrder="siteId recordId ticket">
                <wsdl:input name="downloadNBRStorageFileRequest"
                message="impl:downloadNBRStorageFileRequest"/>
                <wsdl:output name="downloadNBRStorageFileResponse"
                message="impl:downloadNBRStorageFileResponse"/>
            </wsdl:operation>
            <wsdl:operation name="deleteNBRStorageFile"
            parameterOrder="siteId confId recordId ticket">
                <wsdl:input name="deleteNBRStorageFileRequest"
                message="impl:deleteNBRStorageFileRequest"/>
                <wsdl:output name="deleteNBRStorageFileResponse"
                message="impl:deleteNBRStorageFileResponse"/>
            </wsdl:operation>
            <wsdl:operation name="downloadWAVFlie"
            parameterOrder="siteId confId ticket">
                <wsdl:input name="downloadWAVFlieRequest"
                message="impl:downloadWAVFlieRequest"/>
                <wsdl:output name="downloadWAVFlieResponse"
                message="impl:downloadWAVFlieResponse"/>
            </wsdl:operation>
        </wsdl:portType>
        <wsdl:binding name="NBRStorageServiceSoapBinding"
        type="impl:NBRStorageService">
            <wsdlsoap:binding style="rpc"
            transport="http://schemas.xmlsoap.org/soap/http"/>
            <wsdl:operation name="getStorageAccessTicket">
                <wsdlsoap:operation soapAction=""/>
                <wsdl:input name="getStorageAccessTicketRequest">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://wbxservice.nbr.webservice.webex.com"/>
                </wsdl:input>
                <wsdl:output name="getStorageAccessTicketResponse">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://nta1wss.webex.com/nbr/services/NBRStorageService"/>
                </wsdl:output>
            </wsdl:operation>
            <wsdl:operation name="getNBRStorageFile">
                <wsdlsoap:operation soapAction=""/>
                <wsdl:input name="getNBRStorageFileRequest">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://wbxservice.nbr.webservice.webex.com"/>
                </wsdl:input>
                <wsdl:output name="getNBRStorageFileResponse">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://nta1wss.webex.com/nbr/services/NBRStorageService"/>
                </wsdl:output>
            </wsdl:operation>
            <wsdl:operation name="getNBRStorageFile">
                <wsdlsoap:operation soapAction=""/>
                <wsdl:input name="getNBRStorageFileRequest1">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://wbxservice.nbr.webservice.webex.com"/>
                </wsdl:input>
                <wsdl:output name="getNBRStorageFileResponse1">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://nta1wss.webex.com/nbr/services/NBRStorageService"/>
                </wsdl:output>
            </wsdl:operation>
            <wsdl:operation name="downloadNBRStorageFile">
                <wsdlsoap:operation soapAction=""/>
                <wsdl:input name="downloadNBRStorageFileRequest">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://wbxservice.nbr.webservice.webex.com"/>
                </wsdl:input>
                <wsdl:output name="downloadNBRStorageFileResponse">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://nta1wss.webex.com/nbr/services/NBRStorageService"/>
                </wsdl:output>
            </wsdl:operation>
            <wsdl:operation name="deleteNBRStorageFile">
                <wsdlsoap:operation soapAction=""/>
                <wsdl:input name="deleteNBRStorageFileRequest">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://wbxservice.nbr.webservice.webex.com"/>
                </wsdl:input>
                <wsdl:output name="deleteNBRStorageFileResponse">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://nta1wss.webex.com/nbr/services/NBRStorageService"/>
                </wsdl:output>
            </wsdl:operation>
            <wsdl:operation name="downloadWAVFlie">
                <wsdlsoap:operation soapAction=""/>
                <wsdl:input name="downloadWAVFlieRequest">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://wbxservice.nbr.webservice.webex.com"/>
                </wsdl:input>
                <wsdl:output name="downloadWAVFlieResponse">
                    <wsdlsoap:body use="encoded"
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://nta1wss.webex.com/nbr/services/NBRStorageService"/>
                </wsdl:output>
            </wsdl:operation>
        </wsdl:binding>
    <wsdl:service name="NBRStorageServiceService">
        <wsdl:port name="NBRStorageService"
            binding="impl:NBRStorageServiceSoapBinding">
            <wsdlsoap:address
            location="http://nta1wss.webex.com/nbr/services/NBRStorageService"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>